#include <stdio.h>

int main(void)
{
    // 传统写法的初始化
    int a[6] = {0, 0, 0, 0, 0, 212};
    // 指定初始化器(可与普通写法混合)
    int b[10] = {1, 2, [4] = 100, [7] = 10, 1234, 5678};

    for (int i = 0; i < 10; i++) {
        printf("b[%d] = %d\n", i, b[i]);
    }
    /*
        使用混合写法后 在指定下标后出现的值会紧跟前面的指定下标
        b[0] = 1
        b[1] = 2
        b[2] = 0
        b[3] = 0
        b[4] = 100
        b[5] = 0
        b[6] = 0
        b[7] = 10
        b[8] = 1234
        b[9] = 5678

     */

    return 0;
}
