#include <stdio.h>

int main(void)
{
    int NUM = 1234;

    printf("*%d*\n", NUM);
    // *1234*

    /** 1. %数字d 表示字符宽度. 如果超出了宽度, 则使用更宽字段 */
    printf("*%4d*\n", NUM);
    // *1234*
    printf("*%4d*\n", 12345678);
    // *12345678*

    // 2. 使用 - 代表数字位于字段的左端
    printf("*%10d*\n", NUM);
    // *      1234*
    printf("*%-10d*\n", NUM);
    // *1234      *

    /** 3.使用 0 代表在数字前补 0, 输入出现 - /指定精度 则忽略 */
    printf("*%06d*\n", NUM);
    // *001234*
    printf("*%-06d*\n", NUM);
    // *1234  *

    /** 对于浮点数 */
    const double D = 1234.567;

    printf("*%4.2f*\n", D);
    // *1234.57*
    printf("*%+4.2f*\n", D);
    // *+1234.57*
    printf("*%10.2f*\n", D);
    // *   1234.57*
    printf("*%010.2f*\n", D);
    // *0001234.57*
    printf("*%-10.2f*\n", D);
    // *1234.57   *
    printf("*%10.2E*\n", D);
    // * 1.23E+003*

    /** 4.根据上面的用法 实际的一些运用 */

    // 4.1 使用 %Nd 美化数字输出
    printf("%9d %9d %9d \n", 11, 22, 33);
    printf("%9d %9d %9d \n", 11, 2222, 333);
    printf("%9d %9d %9d \n", 111111, 2, 33333);
    /*
            11        22        33
            11      2222       333
        111111         2     33333
     */

    return 0;
}